OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/SRC_UVC/uvc_driver.c
/*
 *      uvc_driver.c  --  USB Video Class driver
 *
 *      Copyright (C) 2005-2010
 *          Laurent Pinchart (laurent.pinchart@ideasonboard.com)
 *
 *      This program is free software; you can redistribute it and/or modify
 *      it under the terms of the GNU General Public License as published by
 *      the Free Software Foundation; either version 2 of the License, or
 *      (at your option) any later version.
 *
 */

/*
 * This driver aims to support video input and ouput devices compliant with the
 * 'USB Video Class' specification.
 *
 * The driver doesn't support the deprecated v4l1 interface. It implements the
 * mmap capture method only, and doesn't do any image format conversion in
 * software. If your user-space application doesn't support YUYV or MJPEG, fix
 * it :-). Please note that the MJPEG data have been stripped from their
 * Huffman tables (DHT marker), you will need to add it back if your JPEG
 * codec can't handle MJPEG data.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "nuc970.h"
#include "sys.h"
#include "usb.h"
#include "usbh_lib.h"
#include "linux_uvc_fake.h"

#define DRIVER_AUTHOR		"Laurent Pinchart <laurent.pinchart@ideasonboard.com>"
#define DRIVER_DESC		"USB Video Class driver"

struct uvc_device  		*g_uvc_vdev = NULL;
struct uvc_streaming  	*g_cur_stream = NULL;

unsigned int uvc_clock_param = CLOCK_MONOTONIC;
unsigned int uvc_no_drop_param;
static unsigned int uvc_quirks_param = 0xffffffff;
unsigned int uvc_trace_param;
unsigned int uvc_timeout_param = UVC_CTRL_STREAMING_TIMEOUT;

/* ------------------------------------------------------------------------
 * Video formats
 */

static struct uvc_format_desc uvc_fmts[] = {
	{
		"YUV 4:2:2 (YUYV)",
		UVC_GUID_FORMAT_YUY2,
		V4L2_PIX_FMT_YUYV,
	},
	{
		"YUV 4:2:2 (YUYV)",
		UVC_GUID_FORMAT_YUY2_ISIGHT,
		V4L2_PIX_FMT_YUYV,
	},
	{
		"YUV 4:2:0 (NV12)",
		UVC_GUID_FORMAT_NV12,
		V4L2_PIX_FMT_NV12,
	},
	{
		"MJPEG",
		UVC_GUID_FORMAT_MJPEG,
		V4L2_PIX_FMT_MJPEG,
	},
	{
		"YVU 4:2:0 (YV12)",
		UVC_GUID_FORMAT_YV12,
		V4L2_PIX_FMT_YVU420,
	},
	{
		"YUV 4:2:0 (I420)",
		UVC_GUID_FORMAT_I420,
		V4L2_PIX_FMT_YUV420,
	},
	{
		"YUV 4:2:0 (M420)",
		UVC_GUID_FORMAT_M420,
		V4L2_PIX_FMT_M420,
	},
	{
		"YUV 4:2:2 (UYVY)",
		UVC_GUID_FORMAT_UYVY,
		V4L2_PIX_FMT_UYVY,
	},
	{
		 "Greyscale (8-bit)",
		 UVC_GUID_FORMAT_Y800,
		 V4L2_PIX_FMT_GREY,
	},
	{
		 "Greyscale (16-bit)",
		 UVC_GUID_FORMAT_Y16,
		 V4L2_PIX_FMT_Y16,
	},
	{
		 "RGB Bayer",
		 UVC_GUID_FORMAT_BY8,
		 V4L2_PIX_FMT_SBGGR8,
	},
	{
		 "RGB565",
		 UVC_GUID_FORMAT_RGBP,
		 V4L2_PIX_FMT_RGB565,
	},
	{
		 "H.264",
		 UVC_GUID_FORMAT_H264,
		 V4L2_PIX_FMT_H264,
	}
};

/* ------------------------------------------------------------------------
 * Utility functions
 */

struct usb_host_endpoint *uvc_find_endpoint(struct usb_host_interface *alts,
		__u8 epaddr)
{
	struct usb_host_endpoint *ep;
	unsigned int i;

	for (i = 0; i < alts->desc.bNumEndpoints; ++i) {
		ep = &alts->endpoint[i];
		if (ep->desc.bEndpointAddress == epaddr)
			return ep;
	}

	return NULL;
}

static struct uvc_format_desc *uvc_format_by_guid(const __u8 guid[16])
{
	unsigned int len = sizeof(uvc_fmts) / sizeof(struct uvc_format_desc);	//ARRAY_SIZE(uvc_fmts);
	unsigned int i;

	for (i = 0; i < len; ++i) {
		if (memcmp(guid, uvc_fmts[i].guid, 16) == 0)
			return &uvc_fmts[i];
	}

	return NULL;
}

static __u32 uvc_colorspace(const __u8 primaries)
{
	static const __u8 colorprimaries[] = {
		0,
		V4L2_COLORSPACE_SRGB,
		V4L2_COLORSPACE_470_SYSTEM_M,
		V4L2_COLORSPACE_470_SYSTEM_BG,
		V4L2_COLORSPACE_SMPTE170M,
		V4L2_COLORSPACE_SMPTE240M,
	};

	if (primaries < sizeof(colorprimaries)) // ARRAY_SIZE(colorprimaries))
		return colorprimaries[primaries];

	return 0;
}

/* Simplify a fraction using a simple continued fraction decomposition. The
 * idea here is to convert fractions such as 333333/10000000 to 1/30 using
 * 32 bit arithmetic only. The algorithm is not perfect and relies upon two
 * arbitrary parameters to remove non-significative terms from the simple
 * continued fraction decomposition. Using 8 and 333 for n_terms and threshold
 * respectively seems to give nice results.
 */
void uvc_simplify_fraction(uint32_t *numerator, uint32_t *denominator,
		unsigned int n_terms, unsigned int threshold)
{
	uint32_t *an;
	uint32_t x, y, r;
	unsigned int i, n;

	an = kmalloc(n_terms * sizeof *an, GFP_KERNEL);
	if (an == NULL)
		return;

	/* Convert the fraction to a simple continued fraction. See
	 * http://mathforum.org/dr.math/faq/faq.fractions.html
	 * Stop if the current term is bigger than or equal to the given
	 * threshold.
	 */
	x = *numerator;
	y = *denominator;

	for (n = 0; n < n_terms && y != 0; ++n) {
		an[n] = x / y;
		if (an[n] >= threshold) {
			if (n < 2)
				n++;
			break;
		}

		r = x - an[n] * y;
		x = y;
		y = r;
	}

	/* Expand the simple continued fraction back to an integer fraction. */
	x = 0;
	y = 1;

	for (i = n; i > 0; --i) {
		r = y;
		y = an[i-1] * y + x;
		x = r;
	}

	*numerator = y;
	*denominator = x;
	kfree(an);
}

/* Convert a fraction to a frame interval in 100ns multiples. The idea here is
 * to compute numerator / denominator * 10000000 using 32 bit fixed point
 * arithmetic only.
 */
uint32_t uvc_fraction_to_interval(uint32_t numerator, uint32_t denominator)
{
	uint32_t multiplier;

	/* Saturate the result if the operation would overflow. */
	if (denominator == 0 ||
	    numerator/denominator >= ((uint32_t)-1)/10000000)
		return (uint32_t)-1;

	/* Divide both the denominator and the multiplier by two until
	 * numerator * multiplier doesn't overflow. If anyone knows a better
	 * algorithm please let me know.
	 */
	multiplier = 10000000;
	while (numerator > ((uint32_t)-1)/multiplier) {
		multiplier /= 2;
		denominator /= 2;
	}

	return denominator ? numerator * multiplier / denominator : 0;
}

/* ------------------------------------------------------------------------
 * Terminal and unit management
 */
struct uvc_entity *uvc_entity_by_id(struct uvc_device *dev, int id)
{
	struct uvc_entity *entity;

#ifdef NUVOTON_PORTED
	for (entity = list_entry((&dev->entities)->next, struct uvc_entity, list);
	     &entity->list != (&dev->entities);
	     entity = list_entry(entity->list.next, struct uvc_entity, list)) {
#else
	list_for_each_entry(entity, &dev->entities, list) {
#endif
		if (entity->id == id)
			return entity;
	}

